app/controllers/songs_controller.rb

  def index
    # binding.pry
    if params[:artist_id].present?
      artist = Artist.find_by(id: params[:artist_id])
      unless artist
        flash[:alert] = "Artist not found."
        redirect_to artists_path#, alert: "Artist not found."
      else
        @songs = artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    @song = Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]